2D_Plane_EE_Multiphase1/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

xmin    0;        xmax    60;
ymin    0;        ymax    8;
zmin    0;        zmax    1;
nx      300;     ny      40;        nz    1;

vertices
(
    ($xmin $ymin $zmin)    //0
    ($xmax $ymin $zmin)    //1
    ($xmax $ymax $zmin)
    ($xmin $ymax $zmin)
    ($xmin $ymin $zmax)
    ($xmax $ymin $zmax)   
    ($xmax $ymax $zmax)
    ($xmin $ymax $zmax)  

);

blocks
(
    hex (0 1 2 3 4 5 6 7) 
        ($nx $ny $nz) 
    simpleGrading (1 1 1)
    
);

edges
(
);

boundary
(
    inlet
    {
        type patch;
        faces
        (
            (0 4 7 3)
        );
    }
    
    outlet
    {
        type patch;
        faces
        (
            (1 5 6 2)
        );
    }


    top   //symmetry may cause converge problem
    {
        type wall;
        faces
        (
            (3 2 6 7)
        );
    }


    land
    {
        type wall;
        faces
        (
            (0 1 5 4)
        );
    }
    
    frontAndBack
    {
        type empty;
        faces
        (
            (0 1 2 3)
            (4 5 6 7)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
